In [1]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "David", "Alice"],
    "Age": [25, 30, 25, 40, 25],
    "City": ["NY", "LA", "NY", "Chicago", "SF"],
}
df = pd.DataFrame(data)

In [2]:
df

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago
4  Alice   25       SF

In [3]:
df.drop_duplicates()

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago
4  Alice   25       SF

In [4]:
df.drop_duplicates(subset=["Name"])

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [5]:
df.drop_duplicates(keep="last")

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago
4  Alice   25       SF

In [7]:
df.drop_duplicates(keep=False)

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago
4  Alice   25       SF

In [9]:
df.drop_duplicates(inplace=True)
df

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago
4  Alice   25       SF